//Browser_Credential_Theft
let PostIncidentStart = datetime(2025-11-24);
let PostIncidentEnd   = datetime(2025-11-30);
let TargetDevice = "azuki-adminpc";
let User = "yuki.tanaka";
DeviceProcessEvents
| where Timestamp between (PostIncidentStart .. PostIncidentEnd)
| where tolower(DeviceName) == tolower(TargetDevice)
| where ProcessCommandLine has_any ("cookies", "session", "explorer.exe", "select", "login", "password", "browser", "stores")
| order by Timestamp desc
