//Credential_File_Discovery
let PostIncidentStart = datetime(2025-11-24);
let PostIncidentEnd   = datetime(2025-11-30);
let TargetDevice = "azuki-adminpc";
let User = "yuki.tanaka";
DeviceProcessEvents
| where Timestamp between (PostIncidentStart .. PostIncidentEnd)
| where tolower(DeviceName) == tolower(TargetDevice)
| where ProcessCommandLine has_any (@"\Users\", @"\Desktop\", @"\Documents\")
| project Timestamp, DeviceName, AccountName, FileName, ProcessCommandLine
| order by Timestamp desc
